ankrysm/esp32_ws2812/main/rest_server_post.c
/* HTTP Restful API Server

   This example code is in the Public Domain (or CC0 licensed, at your option.)

   Unless required by applicable law or agreed to in writing, this
   software is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR
   CONDITIONS OF ANY KIND, either express or implied.
*/


#include "esp32_ws2812.h"

/*
#define MAX_CONTENTLEN 10240

extern esp_vfs_spiffs_conf_t fs_conf;
extern T_LOG_ENTRY logtable[];
extern size_t sz_logtable;
extern int log_write_idx;

typedef struct rest_server_context {
    char base_path[ESP_VFS_PATH_MAX + 1];
} rest_server_context_t;

#define CHECK_FILE_EXTENSION(filename, ext) (strcasecmp(&filename[strlen(filename) - strlen(ext)], ext) == 0)


static httpd_handle_t server = NULL;
*/

/*
// from global_data.c
extern T_HTTP_PROCCESSING_TYPE http_processing[];
extern T_TRACK tracks[];
extern T_DISPLAY_OBJECT *s_object_list;
extern T_EVENT_GROUP *s_event_group_list;
extern char last_loaded_file[];
extern size_t sz_last_loaded_file;
*/
/*
static void http_help(httpd_req_t *req) {
	char resp_str[255];
	snprintf(resp_str, sizeof(resp_str), "path - description\n");
	httpd_resp_sendstr_chunk(req, resp_str);

	for  (int i=0; http_processing[i].todo != HP_END_OF_LIST; i++) {
		snprintf(resp_str, sizeof(resp_str),"'%s%s' - %s%s\n",
				http_processing[i].path,
				(http_processing[i].flags & HPF_PATH_FROM_URL ? "<fname>" : ""),
				http_processing[i].help,
				(http_processing[i].flags & HPF_POST ? ", requires POST data" : "")
		);
		httpd_resp_sendstr_chunk(req, resp_str);
	}

}

static void add_system_informations(cJSON *root) {
	esp_chip_info_t chip_info;
	esp_chip_info(&chip_info);

	const esp_app_desc_t *app_desc = esp_app_get_description();

	size_t total,used;
	storage_info(&total,&used);

//	cJSON *sysinfo = cJSON_AddObjectToObject(root,"system");
//	cJSON *fs_size = cJSON_AddObjectToObject(sysinfo,"filesystem");

	cJSON_AddStringToObject(root, "version", IDF_VER);
	cJSON_AddNumberToObject(root, "cores", chip_info.cores);
	cJSON_AddNumberToObject(root, "free_heap_size",esp_get_free_heap_size());
	cJSON_AddNumberToObject(root, "minimum_free_heap_size",esp_get_minimum_free_heap_size());
	cJSON_AddNumberToObject(root, "filesystem_total", total);
	cJSON_AddNumberToObject(root, "filesystem_used", used);
	cJSON_AddStringToObject(root, "compile_date", app_desc->date);
	cJSON_AddStringToObject(root, "compile_time", app_desc->time);
	cJSON_AddStringToObject(root, "app_version", app_desc->version);
}


static void get_path_from_uri(const char *uri, char *dest, size_t destsize)
{
    size_t pathlen = strlen(uri);

    const char *quest = strchr(uri, '?');
    if (quest) {
        pathlen = MIN(pathlen, quest - uri);
    }
    const char *hash = strchr(uri, '#');
    if (hash) {
        pathlen = MIN(pathlen, hash - uri);
    }
    strlcpy(dest, uri, MIN(destsize, pathlen + 1));
}

static T_HTTP_PROCCESSING_TYPE *get_http_processing(char *path) {

	for  (int i=0; http_processing[i].todo != HP_END_OF_LIST; i++) {
		if ( http_processing[i].flags & HPF_PATH_FROM_URL) {
			// if a filename is expected compare with strstr
			if ( strstr(path, http_processing[i].path) == path) {
				return &http_processing[i];
			}
		} else {
			// if no filename expected compare with strcmp
			if ( !strcmp(path, http_processing[i].path)) {
				return &http_processing[i];
			}
		}
	}
	return NULL;
}

static void get_handler_list_err(httpd_req_t *req) {
	char buf[512];

	if( obtain_logsem_lock() != ESP_OK ) {
		ESP_LOGE(__func__, "xSemaphoreTake failed");
		return;
	}

	int pos=log_write_idx;
	for ( int i=0; i < N_LOG_ENTRIES; i++) {
		esp_err_t res = log_entry2text(pos, buf, sizeof(buf));
		pos++;
		if ( pos >= N_LOG_ENTRIES) {
			pos=0;
		}
		if ( res == ESP_ERR_NOT_FOUND )
			continue;

		strlcat(buf, "\n", sizeof(buf));
		httpd_resp_sendstr_chunk(req, buf);
	}
	release_logsem_lock();
}


static void get_handler_clear_err(httpd_req_t *req) {

	if( obtain_logsem_lock() != ESP_OK ) {
		ESP_LOGE(__func__, "xSemaphoreTake failed");
		return;
	}

	log_write_idx = 0;
	memset(logtable, 0, sz_logtable);

	httpd_resp_sendstr_chunk(req, "done.\n");
	release_logsem_lock();
}


void get_handler_list(httpd_req_t *req) {
	// list events
	char buf[255];
	const size_t sz_buf = sizeof(buf);

	//extern T_SCENE *s_scene_list;
	if (obtain_eventlist_lock() != ESP_OK) {
		snprintf(buf, sz_buf, "%s couldn't get lock on eventlist\n", __func__);
		httpd_resp_sendstr_chunk(req, buf);
		return;
	}

	snprintf(buf, sz_buf, "\n*** objects ***\n");
	httpd_resp_sendstr_chunk(req, buf);

	if ( !s_object_list) {
		snprintf(buf, sz_buf, "   no objects\n");
		httpd_resp_sendstr_chunk(req, buf);

	} else {
		for (T_DISPLAY_OBJECT *obj=s_object_list; obj; obj=obj->nxt) {
			snprintf(buf, sz_buf, "   object '%s'\n", obj->oid);
			httpd_resp_sendstr_chunk(req, buf);
			if (obj->data) {
				for(T_DISPLAY_OBJECT_DATA *data = obj->data; data; data=data->nxt) {
					if ( data->type == OBJT_BMP) {
						snprintf(buf, sz_buf,"    id=%d, type=%d/%s, len=%d, url=%s\n",
								data->id, data->type, object_type2text(data->type), data->len,
								data->para.bmp.url
						);
					} else if (data->type == OBJT_COLOR_TRANSITION) {
						snprintf(buf, sz_buf,"    id=%d, type=%d/%s, len=%d hsv from=%d/%d/%d hsv to=%d/%d/%d\n",
								data->id, data->type, object_type2text(data->type), data->len,
								data->para.tr.hsv_from.h, data->para.tr.hsv_from.s, data->para.tr.hsv_from.v,
								data->para.tr.hsv_to.h, data->para.tr.hsv_to.s, data->para.tr.hsv_to.v
						);
					} else if (data->type == OBJT_RAINBOW) {
						snprintf(buf, sz_buf,"    id=%d, type=%d/%s, len=%d\n",
								data->id, data->type, object_type2text(data->type), data->len
						);
					} else {
						snprintf(buf, sz_buf,"    id=%d, type=%d/%s, len=%d hsv=%d/%d/%d\n",
								data->id, data->type, object_type2text(data->type), data->len,
								data->para.hsv.h, data->para.hsv.s, data->para.hsv.v
						);
					}
					httpd_resp_sendstr_chunk(req, buf);

