ankrysm/esp32_ws2812/main/rest_server_post.c
				}
			} else {
				snprintf(buf, sz_buf, "   no data list in object\n");
				httpd_resp_sendstr_chunk(req, buf);
			}

		}
	}

	snprintf(buf, sz_buf, "\n*** events ***\n");
	httpd_resp_sendstr_chunk(req, buf);

	if ( !s_event_group_list) {
		snprintf(buf, sz_buf, "   no events\n");
		httpd_resp_sendstr_chunk(req, buf);

	} else {
		for ( T_EVENT_GROUP *evtgrp= s_event_group_list; evtgrp; evtgrp = evtgrp->nxt) {
			snprintf(buf, sz_buf, "   Event id='%s':\n", evtgrp->id);
			httpd_resp_sendstr_chunk(req, buf);

			// INIT events
			if (evtgrp->evt_init_list) {
				snprintf(buf, sz_buf,"    INIT events:\n");
				httpd_resp_sendstr_chunk(req, buf);

				for (T_EVENT *evt = evtgrp->evt_init_list; evt; evt=evt->nxt) {
					httpd_resp_sendstr_chunk(req,"     ");
					event2text(evt, buf, sizeof(buf));
					httpd_resp_sendstr_chunk(req, buf);
					httpd_resp_sendstr_chunk(req,"\n");
				}
			} else {
				snprintf(buf, sz_buf,"    INIT events: none\n");
				httpd_resp_sendstr_chunk(req, buf);
			}

			// WORK events
			if (evtgrp->evt_work_list) {
				snprintf(buf, sz_buf,"    WORK events:\n");
				httpd_resp_sendstr_chunk(req, buf);

				for (T_EVENT *evt = evtgrp->evt_work_list; evt; evt=evt->nxt) {
					httpd_resp_sendstr_chunk(req,"     ");
					event2text(evt, buf, sizeof(buf));
					httpd_resp_sendstr_chunk(req, buf);
					httpd_resp_sendstr_chunk(req,"\n");

				}
			} else {
				snprintf(buf, sz_buf,"    WORK events: none\n.");
				httpd_resp_sendstr_chunk(req, buf);
			}

			// FINAL events
			if (evtgrp->evt_final_list) {
				snprintf(buf, sz_buf,"    FINAL events:\n");
				httpd_resp_sendstr_chunk(req, buf);

				for (T_EVENT *evt = evtgrp->evt_final_list; evt; evt=evt->nxt) {
					httpd_resp_sendstr_chunk(req,"     ");
					event2text(evt, buf, sizeof(buf));
					httpd_resp_sendstr_chunk(req, buf);
					httpd_resp_sendstr_chunk(req,"\n");

				}
			} else {
				snprintf(buf, sz_buf,"    FINAL events: none.\n");
				httpd_resp_sendstr_chunk(req, buf);
			}
		}
	}


	snprintf(buf, sz_buf, "\n*** tracks: ***\n");
	httpd_resp_sendstr_chunk(req, buf);

	for (int i = 0; i < N_TRACKS; i++) {
		T_TRACK *track = &(tracks[i]);
		if ( ! track->element_list) {
			snprintf(buf, sz_buf, "* track %2d is empty\n", i);
			httpd_resp_sendstr_chunk(req, buf);
			continue; // nothing to process
		}
		snprintf(buf, sz_buf, "* track %2d:\n", i);
		httpd_resp_sendstr_chunk(req, buf);
		for( T_TRACK_ELEMENT *ele = track->element_list; ele; ele = ele->nxt) {
			snprintf(buf,sz_buf, "    id=%d, event='%s', repeat=%d\n", ele->id, ele->evtgrp ? ele->evtgrp->id : "", ele->repeats);
			httpd_resp_sendstr_chunk(req, buf);
		}
	}

	httpd_resp_sendstr_chunk(req, "\n");

	release_eventlist_lock();
}

static esp_err_t get_handler_file_list(httpd_req_t *req) {
    char entrypath[LEN_PATH_MAX];
    char msg[64];
    const char *entrytype;

    struct dirent *entry;
    struct stat entry_stat;

    DIR *dir = opendir(fs_conf.base_path);

    if (!dir) {
    	snprintf(msg, sizeof(msg),"Failed to stat dir : '%s'", fs_conf.base_path);
        ESP_LOGE(__func__, "%s", msg);
        // Respond with 404 Not Found
		snprintfapp(msg, sizeof(msg), "\n");
        httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, msg);
        return ESP_FAIL;
    }

    httpd_resp_set_type(req, "application/json");
    cJSON *root = cJSON_CreateObject();
    cJSON *files = cJSON_CreateArray();
    cJSON_AddItemToObject(root, "files", files);

    // Iterate over all files / folders and fetch their names and sizes
    while ((entry = readdir(dir)) != NULL) {
        entrytype = (entry->d_type == DT_DIR ? "dir" : "file");

        snprintf(entrypath, sizeof(entrypath), "%s/%s",fs_conf.base_path, entry->d_name);
        if (stat(entrypath, &entry_stat) == -1) {
        	snprintf(msg, sizeof(msg),"Failed to stat '%s' : '%s'", entrytype, entry->d_name);
            ESP_LOGE(__func__, "%s", msg);
            closedir(dir);
    		snprintfapp(msg, sizeof(msg), "\n");
            httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, msg);
            return ESP_FAIL;
        }
        cJSON *fentry = cJSON_CreateObject();
        cJSON_AddStringToObject(fentry,"type",  entrytype);
        cJSON_AddStringToObject(fentry,"name",  entry->d_name);
        cJSON_AddNumberToObject(fentry,"sz",entry_stat.st_size);
        char tbuf[64];
        get_shorttime4(entry_stat.st_mtime, tbuf, sizeof(tbuf));
        cJSON_AddStringToObject(fentry,"mtime",  tbuf);

        cJSON_AddItemToArray(files, fentry);

        snprintf(msg, sizeof(msg), "%s '%s' (%ld bytes, mtime %s)", entrytype, entry->d_name, entry_stat.st_size, tbuf);
        //httpd_resp_sendstr_chunk(req, msg);
        ESP_LOGI(__func__, "%s", msg);
    }
    closedir(dir);

    char *resp = cJSON_PrintUnformatted(root);
    ESP_LOGI(__func__,"RESP=%s", resp?resp:"nix");

    //httpd_resp_sendstr_chunk(req, "STATUS=");
	httpd_resp_sendstr_chunk(req, resp);
	httpd_resp_sendstr_chunk(req, "\n"); // response more readable

    free((void *)resp);
    cJSON_Delete(root);

    ESP_LOGI(__func__,"ended.");
    return ESP_OK;
}

/ **
 * delivers status informations in JSON
 * /
static void response_with_status(httpd_req_t *req, char *msg, run_status_type status) {
    httpd_resp_set_type(req, "application/json");
    cJSON *root = cJSON_CreateObject();

    if (msg && strlen(msg))
    	cJSON_AddStringToObject(root, "msg", msg);
    cJSON_AddStringToObject(root, "status", RUN_STATUS_TYPE2TEXT(status));
    cJSON_AddNumberToObject(root, "scene_time", get_scene_time());
    cJSON_AddNumberToObject(root, "timer_period", get_event_timer_period());
    if (strlen(last_loaded_file)) {
    	cJSON_AddStringToObject(root, "last_loaded_file", last_loaded_file);
    }
    add_system_informations(root);

    char txt[64];
    get_current_timestamp(txt, sizeof(txt));
	cJSON_AddStringToObject(root, "current_time_stamp", txt);

    char *resp = cJSON_PrintUnformatted(root);
    ESP_LOGI(__func__,"RESP=%s", resp?resp:"nix");

    //httpd_resp_sendstr_chunk(req, "STATUS=");
	httpd_resp_sendstr_chunk(req, resp);
	httpd_resp_sendstr_chunk(req, "\n"); // response more readable

