ankrysm/esp32_ws2812/main/rest_server_post.c
    free((void *)resp);
    cJSON_Delete(root);
}

static void get_handler_status_current(httpd_req_t *req) {
	response_with_status(req, "", get_scene_status());
}

// run/pause/stop/blank
static void get_handler_scene_new_status(httpd_req_t *req, run_status_type new_status) {

	bool changed = false;
	run_status_type old_status = get_scene_status();

	if ( new_status == RUN_STATUS_ASK) {
		new_status = old_status;
	} else {
		// not ask, set it
		if ( old_status != new_status) {
			changed = true;
			old_status = set_scene_status(new_status);
		}
	}
	httpd_resp_set_type(req, "application/json");

	cJSON *root = cJSON_CreateObject();

	char txt[32];

	switch (new_status) {
	case RUN_STATUS_STOPPED:
	case RUN_STATUS_STOP_AND_BLANK:
		strlcpy(txt,"STOPPED", sizeof(txt));
		break;
	case RUN_STATUS_RUNNING:
		if ( changed) {
			if ( old_status == RUN_STATUS_PAUSED) {
				strlcpy(txt, "CONTINUE", sizeof(txt));
			} else {
				strlcpy(txt, "STARTING", sizeof(txt));
			}
		} else {
			strlcpy(txt, "RUNNING", sizeof(txt));
		}
		break;
	case RUN_STATUS_PAUSED:
		strlcpy(txt,"PAUSE", sizeof(txt));
		break;
	default:
		strlcpy(txt,"UNKNOWN", sizeof(txt));
	}
	cJSON_AddStringToObject(root, "text", txt);
	cJSON_AddNumberToObject(root, "scene_time", get_scene_time());
	cJSON_AddStringToObject(root, "last_loaded_file", strlen(last_loaded_file) ? last_loaded_file :"");

	char *resp = cJSON_PrintUnformatted(root);
	ESP_LOGI(__func__,"RESP=%s", resp?resp:"nix");

	httpd_resp_sendstr_chunk(req, resp);
	httpd_resp_sendstr_chunk(req, "\n"); // response more readable

	free((void *)resp);
	cJSON_Delete(root);

}

static esp_err_t clear_data(char *msg, size_t sz_msg, run_status_type new_status) {
	memset(msg, 0, sz_msg);

	// stop display program
	run_status_type old_status = get_scene_status();
	if ( old_status != new_status) {
		old_status = set_scene_status(new_status);
		snprintf(msg, sz_msg,"new status set, ");
	}

	bool hasError = false;
	if (clear_event_group_list() == ESP_OK) {
		snprintfapp(msg,sz_msg,"event group list cleared");
	} else {
		hasError=true;
		snprintfapp(msg,sz_msg,"clear event group list failed");
	}

	if ( clear_object_list() == ESP_OK) {
		snprintfapp(msg, sz_msg,", object list cleared");
	} else {
		hasError = true;
		snprintfapp(msg,sz_msg - strlen(msg),", clear object list failed");
	}
	if ( clear_tracks() == ESP_OK) {
		snprintfapp(msg, sz_msg,", track list cleared");
	} else {
		hasError = true;
		snprintfapp(msg,sz_msg - strlen(msg),", clear track list failed");
	}
	return hasError ? ESP_FAIL : ESP_OK;

}


static esp_err_t get_handler_clear(httpd_req_t *req) {
	char msg[255];

    LOG_MEM(__func__,1);
	// stop display program, clear data
	run_status_type new_status = RUN_STATUS_STOPPED;
	esp_err_t res = clear_data(msg, sizeof(msg), new_status);

    LOG_MEM(__func__,2);

    httpd_resp_set_type(req, "plain/text");
 	snprintf(msg,sizeof(msg), "clear data done");
 	httpd_resp_sendstr_chunk(req, msg);

	return res;
}

static void get_handler_restart(httpd_req_t *req) {
	char resp_str[64];

	snprintf(resp_str, sizeof(resp_str),"Restart initiated\n");
	httpd_resp_sendstr_chunk(req, resp_str);

	httpd_resp_send_chunk(req, NULL, 0);

	ESP_LOGI(__func__,"Restarting in a second...\n");
	vTaskDelay(1000 / portTICK_PERIOD_MS);
    ESP_LOGI(__func__, "Restarting now.\n");
    fflush(stdout);
    esp_restart();
}

static void get_handler_reset(httpd_req_t *req) {

	// clear nvs
	nvs_flash_erase();
	scenes_stop(true);

	char resp_str[64];
	snprintf(resp_str, sizeof(resp_str),"RESET done\n");
	httpd_resp_sendstr_chunk(req, resp_str);

	get_handler_restart(req);
}

static void get_handler_config(httpd_req_t *req, char *msg) {
    httpd_resp_set_type(req, "application/json");
    cJSON *root = cJSON_CreateObject();

    if (msg && strlen(msg))
    	cJSON_AddStringToObject(root, "msg", msg);

    // configuration
    add_config_informations(root);

    char *resp = cJSON_PrintUnformatted(root);
    ESP_LOGI(__func__,"resp=%s", resp?resp:"nix");
	httpd_resp_sendstr_chunk(req, resp);
	httpd_resp_sendstr_chunk(req, "\n");

    free((void *)resp);
    cJSON_Delete(root);

}
*/

/**
 * decodes JSON content and stores data in memory.
 * scenes will be stopped and data will be overwritten
 */
esp_err_t post_handler_load(httpd_req_t *req, char *content) {
	char msg[255];
	memset(msg, 0, sizeof(msg));

	// stop display, clear data
	run_status_type new_status = RUN_STATUS_STOPPED;
	esp_err_t res = clear_data(msg, sizeof(msg), new_status);
	if ( res != ESP_OK ) {
		log_warn(__func__, "%s", msg);
		snprintfapp(msg, sizeof(msg), "\n");
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, msg);
        return ESP_FAIL;
	}

	if ( decode_json4event_root(content, msg, sizeof(msg)) != ESP_OK) {
		log_warn(__func__, "%s", msg);
		snprintfapp(msg, sizeof(msg), "\n");
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, msg);
        return ESP_FAIL;
	}

	ESP_LOGI(__func__, "ended with '%s'", msg);
    httpd_resp_set_type(req, "plain/text");
	snprintf(msg,sizeof(msg), "data load done");
	httpd_resp_sendstr_chunk(req, msg);

	return res;

}

/**
 * stores content in flash file
 */
esp_err_t post_handler_file_store(httpd_req_t *req, char *content, char *fname, size_t sz_fname) {
	char msg[255];
	memset(msg, 0, sizeof(msg));


	if ( store_events_to_file(fname, content, msg, sizeof(msg))!= ESP_OK) {
		log_err(__func__, "%s", msg);
		snprintfapp(msg, sizeof(msg), "\n");
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, msg);
        return ESP_FAIL;
	}

	snprintf(msg,sizeof(msg), "content saved to %s",fname);
	log_info(__func__, "success: %s", msg);

	// successful
    httpd_resp_set_type(req, "plain/text");
    char resp_txt[256];
	snprintf(resp_txt,sizeof(resp_txt), "content saved to %s",fname);
	snprintfapp(msg,sizeof(msg), "Response: '%s'",resp_txt);
	httpd_resp_sendstr_chunk(req, resp_txt);

	return ESP_OK;
}

/**
 * load file from flash into memory
 * /
static esp_err_t get_handler_file_load(httpd_req_t *req, char *fname, size_t sz_fname) {
	char errmsg[128];
	char msg[256];

