ankrysm/esp32_ws2812/main/rest_server_post.c
	memset(msg,0,sizeof(msg));
	memset(errmsg,0,sizeof(errmsg));

	ESP_LOGI(__func__, "fname '%s'", fname);

	// stop display program and clear data
	run_status_type new_status = RUN_STATUS_STOPPED;
	if ( clear_data(msg, sizeof(msg), new_status) != ESP_OK) {
		log_warn(__func__, "clear_data failed, %s", msg);
		snprintfapp(msg, sizeof(msg), "\n");
		httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, msg);
		return ESP_FAIL;
	}

	// load new data
	if ( load_events_from_file(fname, errmsg, sizeof(errmsg)) != ESP_OK) {
		snprintfapp(msg,sizeof(msg), ", load content from %s failed: %s",fname, errmsg);
		log_warn(__func__, "load_events_from_file failed, %s", msg);
		snprintfapp(msg, sizeof(msg), "\n");
		httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, msg);
		return ESP_FAIL;
	}

	// successful
	log_info(__func__,"content loaded from %s",fname);
	snprintf(last_loaded_file, sz_last_loaded_file,"%s", fname);

	snprintfapp(msg,sizeof(msg), ", content loaded from %s",fname);
	httpd_resp_sendstr_chunk(req, msg);
	return ESP_OK;
}

/ **
 * delete flash file
 * /
static esp_err_t get_handler_file_delete(httpd_req_t *req, char *fname, size_t sz_fname) {
	char msg[256];
	memset(msg,0,sizeof(msg));

	int lrc;

	add_base_path(fname, sz_fname);
	if ((lrc=unlink(fname))) {
		snprintfapp(msg, sizeof(msg),", deletion '%s' failed, lrc=%d(%s)", fname, lrc, esp_err_to_name(lrc));
		ESP_LOGW(__func__, "error %s", msg);
		httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, msg);
		return ESP_FAIL;
	}
	snprintfapp(msg, sizeof(msg),", '%s' deleted", fname);
	return ESP_OK;
}

/ **
 * get file content
 * /
static esp_err_t get_handler_file_get(httpd_req_t *req, char *fname, size_t sz_fname) {
	esp_err_t res = ESP_FAIL;
	char msg[255];

	add_base_path(fname, sz_fname);
	FILE *f = fopen(fname, "r");
	if (f == NULL) {
		snprintf(msg, sizeof(msg), "failed to open '%s' for reading", fname);
		ESP_LOGW(__func__, "%s", msg);
		snprintfapp(msg, sizeof(msg), "\n");
        httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, msg);
        return ESP_FAIL;

	}

    httpd_resp_set_type(req, "plain/text");

	size_t n;
	while ( (n=fread(msg, sizeof(char),sizeof(msg), f)) > 0) {
		httpd_resp_send_chunk(req, msg, n);
	}
	fclose(f);
	res = ESP_OK;


	return res;
}
*/

/**
 * load data into memory
 * first stop scene
 */
 esp_err_t post_handler_config_set(httpd_req_t *req, char *buf) {
	char msg[255];
	memset(msg, 0, sizeof(msg));

	// stop display for newe config
	run_status_type new_status = RUN_STATUS_STOPPED;
	set_scene_status(new_status);

	char errmsg[64];
	esp_err_t res = decode_json4config_root(buf, errmsg, sizeof(errmsg));

	if (res == ESP_OK) {
		snprintf(msg, sizeof(msg), "decoding data done: %s", errmsg);
		log_info(__func__, "%s", msg);
	} else {
		snprintf(msg, sizeof(msg), "decoding data failed: %s", errmsg);
		log_err(__func__, "%s", msg);
		snprintfapp(msg, sizeof(msg),"\n");
		httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, msg);
		return ESP_FAIL;
	}

	get_handler_config(req, msg);

	return ESP_OK;

}

/**
 * isn't a file name
 * is <r>/<g>/<b>/[len]/[start]
 * len default = 10
 * start default=0
 * /
static esp_err_t get_handler_test(httpd_req_t *req, char *fname, size_t sz_fname) {
	char msg[256];
	memset(msg,0,sizeof(msg));

	char *sR, *sG, *sB, *sLen, *sStart, *l, *s;
	unsigned long lR, lG, lB, lLen,lStart;
	lR=lG=lB=0;
	lLen=10;
	lStart=0;
	sR=sG=sB=sLen=sStart=NULL;

	T_COLOR_RGB rgb= {.r=0, .g=0, .b=0};
	if ( strlen(fname)) {
		s = strdup(fname);
		do {
			sR = strtok_r(s, "/", &l);
			lR = strtoul(sR, NULL, 0);

			if ( !(sG = strtok_r(NULL, "/", &l))) break;
			lG = strtoul(sG, NULL, 0);

			if ( !(sB = strtok_r(NULL, "/", &l))) break;
			lB = strtoul(sB, NULL, 0);

			if ( !(sLen = strtok_r(NULL, "/", &l))) break;
			lLen = strtoul(sLen, NULL, 0);
			if ( lLen < 1) lLen=1;
			if ( lLen > 1000) lLen = 1000;

			if ( !(sStart = strtok_r(NULL, "/", &l))) break;
			lStart = strtoul(sStart, NULL, 0);
			if ( lStart > 1000 ) lStart = 1000;

		} while(0);
		free(s);
	}
	rgb.r=lR & 0xFF;
	rgb.g=lG & 0xFF;
	rgb.b=lB & 0xFF;

	strip_set_range(lStart, lStart+lLen-1, &rgb);
	strip_show(true);

	snprintf(msg, sizeof(msg),", '%s' processed, set pixel pos=%d, len=%d, RGB=[%d,%d,%d]=[%x,%x,%x]",
			fname, lStart, lLen,
			rgb.r, rgb.g, rgb.b,
			rgb.r, rgb.g, rgb.b);
	ESP_LOGI(__func__, "%s", msg);

	httpd_resp_sendstr_chunk(req, msg);
	return ESP_OK;
}


/ **
 * uri should be data/add or data/set with POST-data
 * /set?id=<id> - replaces event with this id
 * /add - adds event
 * /
static esp_err_t post_handler_main(httpd_req_t *req)
{
	ESP_LOGI(__func__,"running on core %d",xPortGetCoreID());
	char path[256];
	get_path_from_uri(req->uri, path, sizeof(path));
	ESP_LOGI(__func__,"uri='%s', contenlen=%d, path='%s'", req->uri, req->content_len, path);

	char resp_str[255];
	memset(resp_str, 0, sizeof(resp_str));

	T_HTTP_PROCCESSING_TYPE *pt = get_http_processing(path);

	if (!pt ) {
        snprintf(resp_str,sizeof(resp_str),"nothing found");
        ESP_LOGE(__func__, "%s", resp_str);
		snprintfapp(resp_str, sizeof(resp_str), "\n");
        httpd_resp_send_err(req, HTTPD_404_NOT_FOUND, resp_str);
        return ESP_FAIL;
	}

	if ( req->content_len > MAX_CONTENTLEN) {
        ESP_LOGE(__func__, "Content too large : %d bytes", req->content_len);
        snprintf(resp_str,sizeof(resp_str),"Data size must be less then %d bytes!",MAX_CONTENTLEN);
		snprintfapp(resp_str, sizeof(resp_str), "\n");
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, resp_str);
        return ESP_FAIL;
	}

	char fname[LEN_PATH_MAX];
	memset(fname, 0, sizeof(fname));
	strlcpy(fname, &path[strlen(pt->path)], sizeof(fname));
	ESP_LOGI(__func__, "fname='%s'", fname);

	if ((pt->flags & HPF_PATH_FROM_URL) && !strlen(fname) ) {
		// file name needed
        snprintf(resp_str,sizeof(resp_str),"filename in URL required");
        ESP_LOGE(__func__, "%s", resp_str);
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, resp_str);
        return ESP_FAIL;
	}

	// content length always greater 0, otherwise it is a GET request
    int remaining = req->content_len;
    char *buf = calloc(req->content_len+1, sizeof(char));
    int received;

